<template>
  <div class="agreement-container">
    <div class="mask"></div>
    <div class="agreement-body">
      <p style="text-align: center">通信行程卡服务协议</p>
      <p>欢迎使用通信行程卡（以下简称“行程卡”）软件或服务。为维护您（以下称为“用户”）自身权益，建议您仔细阅读各条款具体内容。未成年人应在监护人陪同下阅读。如用户使用行程卡软件或服务，即表示用户与软件运营方达成协议，自愿接受本服务协议内的所有内容。</p>
      <p class="agreement-title">一、服务协议的确认和接纳</p>
      <p>本协议是用户与软件运营方之间关于用户使用行程卡软件或服务的协议，内容包括协议正文、《隐私政策》及软件运营方已经发布或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，用户使用行程卡软件或服务的行为将授本协议约束。
      <p>如您对协议有任何疑问，可向软件运营方咨询。</p>
      <p>本协议如由于软件运营方发展需要进行修订的，软件运营方将在行程卡平台公布。用户可前往查阅最新版协议协议。<strong>在软件运营方修改上述协议后，如果用户不接受修改后的协议，用户可以选择终止使用行程卡软件或服务。用户继续使用的，将被视为已接受了修改后的协议。</strong></p>
      <p class="agreement-title">二、服务的变更或终止</p>
      <p>软件运营方因自身决策、政府行为、不可抗力等原因可能会选择中止、中断或终止行程卡的部分或全部服务。如有这种情况发生，软件运营方会采取公告的形式通知用户，但不承担由此对用户造成的任何损失。</p>
      <p class="agreement-title">三、用户隐私制度</p>
      <p><strong>尊重用户隐私是行程卡软件或服务的一项基本政策。软件运营方将按照隐私政策收集、存储、使用、披露和保护用户的个人信息。请用户完整阅读上述隐私政策，以帮助用户更好地保护个人信息。如您未满十四周岁，请您寻求监护人的同意和指导。</strong></p>
      <p class="agreement-title">四、不可抗力条款</p>
      <p><strong>软件运营方对不可抗力导致的损失不承担责任。本服务协议所指不可抗力包括：自然灾害；法律法规或政府指令变更；因网络服务特性而特有的原因，例如境内外基础电信运营商的技术缺陷、计算机或互联网相关技术缺陷、互联网覆盖范围限制、计算机病毒、黑客攻击等因素；征收、征用等政府行为，罢工、骚乱等社会异常事件；其它合法范围内的不能预见、不能避免并不能克服的客观情况。</strong></p>
      <p class="agreement-title">五、禁止服务的商业化</p>
      <p>用户承诺，非经软件运营方同意，用户不能利用行程卡软件或服务进行销售或其它商业用途。如用户有需要将行程卡软件或服务用于非个人使用用途，应书面通知软件运营方并获得软件运营方的明确授权。</p>
      <p class="agreement-title">六、用户管理</p>
      <p><strong>用户对行程卡软件或服务的使用必须符合中国有关法规，不得利用行程卡软件或服务制作、复制、发布、传播法律、法规禁止的信息。</strong></p>
      <p>用户承诺，用户不得利用行程卡软件或服务实施以下行为：</p>
      <p>1、通过非软件运营方开发、授权或认可的第三方兼容软件、系统登录或使用行程卡软件或服务，或针对行程卡软件或服务使用非软件运营方开发、授权或认证的插件；</p>
      <p>2、对行程卡软件或服务进行反向工程、反向汇编、反向编译或以其他方式自行程卡软件或服务获取源代码等；</p>
      <p>3、对于行程卡软件或服务提供的信息，未经软件运营方同意，擅自实施包括但不限于下列行为：使用、出租、出借、出版、复制、修改、链接、转载，建立镜像站点，擅自发展与之有关的衍生产品、服务、插件、外挂、兼容、互联等；</p>
      <p>4、对行程卡软件或服务过程中释放到任何计算机或移动终端内存中的数据及软件运行过程中客户端与服务器端的交互数据进行复制、更改；</p>
      <p>5、其它以任何不合法的方式、为任何不合法的目的、或以与本协议不一致的方式使用行程卡软件或服务。</p>
      <p class="agreement-title">七、通知</p>
      <p>所有发给用户的通知都可通过行程卡软件或服务显著位置公告的方式进行传送。</p>
      <p class="agreement-title">八、内容、专利所有权</p>
      <p><strong>行程卡软件或服务提供的内容包括：</strong></p>
      <p><strong>1、到访地信息。本服务将依据您提供的手机号码为您呈现您过往14天内所停留超4小时的境内外国家（地区）或城市名称信息。到访地信息由电信基础运营商向本服务提供。如用户对到访地信息的准确性有疑义，请咨询电信基础运营商客户服务（移动用户：10086；联通用户：10010；电信用户：10000）。</strong></p>
      <p><strong>2、新冠肺炎确诊患者密切接触提醒。本服务将依据用户手机终端蓝牙近距离接触功能，在您的手机终端记录其他行程卡用户的加密ID及蓝牙接触信息（包括接触时间和信号强度），同时您的加密ID和蓝牙接触信息也会记录到其他行程卡用户的手机终端。仅当用户被诊断为新冠肺炎确诊/疑似患者后，需要配合防疫部门将手机终端的加密ID上传至系统，供其他用户查询是否有过密切接触记录，从而为用户提供新冠肺炎确诊/疑似患者密切接触提醒，方式包括但不限于界面提示及短信提示。</strong></p>
      <p>用户不能为任何营利或非营利的目的擅自复制、再造这些内容，或以转让、许可的方式授权第三方实施利用和转让这些内容。</p>
      <p>行程卡软件或服务保留申请专利的权利。</p>
      <p class="agreement-title">九、法律</p>
      <p>本协议适用于中华人民共和国的法律，并且排除一切冲突法规定的使用。</p>
      <p>如您在使用本协议下服务中出现纠纷的，您同意将纠纷交由北京市海淀区人民法院进行仲裁解决。仲裁裁决是终局的，对双方都有约束力。仲裁费用由败诉一方承担。</p>
      <p>用户使用本平台服务时违反有关法律法规规章规定的，或违反本协议条款约定的，软件运营方可终止向您提供服务。如您的行为使软件运营方遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿本平台的上述全部损失。</p>
      <p class="agreement-title">十、其它</p>
      <p>本协议自发布之日起实施，并构成用户与行程卡软件运营方的共识。软件运营方不行使、未能及时行使或未充分行使本协议或按照法律规定所享有的权利，不应被视为放弃该权利，也不影响软件运营方在将来行使该权利。</p>
      <p>如您对本协议内容有任何疑问，请发送邮件至我们的邮箱：<a href="mailto:xck@caictyds.cn">xck@caictyds.cn</a></p>
    </div>
  </div>
</template>

<script>
export default {
  name: "AgreementBody"
}
</script>

<style scoped>

.agreement-container {
  overflow: scroll;
  max-height: 100vh;
  width: 100vw;
  height: 100vh;
  position: absolute;
  top: 5vh;
}

.agreement-body {
  position: absolute;
  top: 7vh;
  font-size: 1vh;
  width: 96%;
  left: 2vw;
}

p {
  text-align: justify;
  font-size: 1.05vh;
  margin: 1vh auto;
}

.agreement-title {
  text-align: left;
  font-size: 1.3vh;
}

.mask {
  height: 163.5vh;
  position: absolute;
  width: 100vw;
  top: 0;
  background: white;
  z-index: -1;
  overflow: hidden;
}

</style>