<template>
  <div>
    <div class="policy-container">
      <div class="mask"></div>
      <div class="policy-body">
        <p style="text-align: center">隐私政策</p>
        <p>
          本软件尊重并保护所有使用服务用户的个人隐私权，将会按照本隐私权政策的规定使用和披露您的个人信息。但本软件将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本软件不会将这些信息对外披露或向第三方提供。本软件会不时更新本隐私权政策。您在同意本软件服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本软件服务使用协议不可分割的一部分。</p>
        <p class="policy-title">一、适用范围</p>
        <p>本协议适用于在您使用通信行程卡（以下简称“行程卡”）软件或服务时，涉及的个人信息及隐私保护内容。</p>
        <p class="policy-title">二、信息收集</p>
        <p>行程卡软件或服务将收集的个人信息包括：手机号码、随机生成的加密ID以及蓝牙接触信息（包括接触时间和信号强度）。</p>
        <p><strong>1、手机号码：&nbsp;</strong>我们将通过手机号向您发送密接情况的短信通知，并为您提供行程查询服务，如果您拒绝提供手机号码，我们将无法为您提供服务。</p>
        <p><strong>2、加密ID：&nbsp;</strong>苹果设备在升级到iOS 13.5以上版本时会为用户提供Exposure
          Notification暴露通知服务，该服务会定期为用户生成加密ID来记录设备间的蓝牙交互事件，如果用户被确诊为新冠肺炎确诊或疑似患者，他的加密ID会被上传至服务器，供其他用户查询是否有过密切接触记录。</p>
        <p><strong>3、蓝牙接触信息：&nbsp;</strong>应用在提供服务的过程中，会通过蓝牙低功耗协议记录与其他使用服务设备的密切接触事件，接触信息包括接触时间、加密ID及蓝牙信号强度RSSI，接触信息仅保存在本人的设备上，不会上传服务器，并会在14天之后清除。
        </p>
        <p>我们不会收集您的身份证件、行程信息、设备信息及其它任何信息。</p>
        <p class="policy-title">三、设备权限调用</p>
        <p>我们可能会调用您的一些设备权限，以下是调用权限对应的业务功能、我们调用权限的目的，以及调用权限前向您询问的情况。</p>
        <p>您可以在设备的设置功能中选择关闭部分或全部权限，从而拒绝我们使用您的个人信息。使用不同系统的不同设备中，权限显示方式及关闭方式可能有所不同，具体请联系设备及系统开发方。</p>
        <p>为保证您正常使用服务，需向您申请以下权限：</p>
        <p><strong>1、蓝牙权限：&nbsp;</strong>我们将使用蓝牙低功耗协议栈（BLE）探测并记录与您近距离接触过的蓝牙设备。</p>
        <p><strong>2、通知权限：&nbsp;</strong>启用后服务会在第一时间给您推送重要信息。</p>
        <p><strong>3、COVID-19暴露日志和通知：&nbsp;</strong>启用后设备可安全地收集随机ID并将其与附近的设备共享。如果您曾暴露于COVID-19，APP可使用这些ID通知到您。</p>
        <p><strong>4、设备信息权限：&nbsp;</strong>服务会通过该权限获取您的移动网络信息，为您提供运营商一键登录服务。</p>
        <p class="policy-title">四、信息提供</p>
        <p>经过您的授权后，本平台在使用过程中会调取您的手机运营商提供的到访地信息。到访地信息是指您的手机设备在本日之前的14日内到访地的名称信息。到访地是指境外的国家或地区，境内的市级行政区。</p>
        <p>如果使用服务的用户被诊断为新冠肺炎确诊/疑似患者，相关防疫部门将要求该用户上传存储于手机本地的蓝牙接触信息，以供防疫部门分析寻找密切接触者并发出相关提醒。</p>
        <p class="policy-title">五、信息保存</p>
        <p>手机号码：出于服务维护需要，我们将在系统中保存您的手机号码，便于您查询本人的行程信息，服务也会通过短信向您发送重要通知。</p>
        <p>
          蓝牙接触信息：您与他人的蓝牙接触信息（包括接触时间及信号强度）将加密保存在您本人手机终端，并会按照一定的时间周期进行清除。仅当用户被诊断为新冠肺炎确诊/疑似患者后，需要配合防疫部门将手机终端的加密ID上传至系统供其他用户查询是否为密切接触者从而进行提醒。否则，信息将会在给定期限（目前设置为14天）</p>
        <p class="policy-title">六、信息使用</p>
        <p>本平台不会使用您的个人信息。您可自主选择将本平台为您呈现的您的到访地信息在相关场景下进行显示。</p>
        <p>本平台仅在用户被诊断为新冠肺炎确诊/疑似患者时，配合防疫部门上传该用户的加密ID，供其他用户查询是否曾经有过密切接触，从而对其发出提示信息。</p>
        <p class="policy-title">七、信息披露</p>
        <p>我们将遵守相关法律法规，对您的个人信息予以保密。本平台不会将您的信息披露给不受信任的第三方。</p>
        <p>涉及国家安全、公共卫生、重大公共利益相关的情况，根据法律的有关规定，或者行政或司法机构的要求，我们有权将您的个人信息向行政、司法机构披露。</p>
        <p>如您出现违反中国有关法律、法规或者相关规则的情况，我们有权将您的个人信息向行政、司法机构披露。</p>
        <p>本平台无业务合作伙伴，不存在将您的个人信息向业务合作伙伴共享的情形。</p>
        <p class="policy-title">八、信息安全</p>
        <p>如您发现自己的个人信息泄密，请您立即联络本软件客服，以便本软件采取相应措施。</p>
      </div>
    </div>
  </div>

</template>

<script>
export default {
  name: "PolicyBody"
}
</script>

<style scoped>

.policy-container {
  overflow: scroll;
  max-height: 100vh;
  width: 100vw;
  height: 100vh;
  position: absolute;
}

.policy-body {
  position: absolute;
  top: 7vh;
  font-size: 1vh;
  width: 96%;
  left: 2vw;
}

p {
  text-align: justify;
  font-size: 1.05vh;
  margin: 1vh auto;
}

.policy-title {
  text-align: left;
  font-size: 1.3vh;
}

.mask {
  height: 141vh;
  position: absolute;
  width: 100vw;
  top: 0;
  background: white;
  z-index: -1;
  overflow: hidden;
}

</style>